[
    {
        "id": "1",
        "slug": "the-war-of-the-worlds",
        "title": "The War of the Worlds",
        "author": "H.G. Wells",
        "rating": "3.83",
        "genre": "Aliens",
        "description": "When an army of invading Martians lands in England, panic and terror seize the population. As the aliens traverse the country in huge three-legged machines, incinerating all in their path with a heat ray and spreading noxious toxic gases, the people of the Earth must come to terms with the prospect of the end of human civilization and the beginning of Martian rule.Inspiring films, radio dramas, comic-book adaptations, television series and sequels,The War of the Worlds is a prototypical work of science fiction which has influenced every alien story that has come since, and is unsurpassed in its ability to thrill, well over a century since it was first published.",
        "year": "1898",
        "goodreads": "https://www.goodreads.com/book/show/8909.The_War_of_the_Worlds",
        "bookshop": "https://www.google.com",
        "cover": "./covers/1.avif"
    },
    {
        "id": "2",
        "slug": "a-princess-of-mars",
        "title": "A Princess of Mars",
        "author": "Edgar Rice Burroughs",
        "rating": "3.81",
        "genre": "Aliens",
        "description": "A Princess of Mars is the first of eleven thrilling novels that comprise Edgar Rice Burroughs' most exciting saga, known as The Martian Series. It's the beginning of an incredible odyssey in which John Carter, a gentleman from Virginia and a Civil War veteran, unexpectedly finds himself on to the red planet, scene of continuing combat among rival tribes. Captured by a band of six-limbed, green-skinned savage giants called Tharks, Carter soon is accorded all the honor of a chieftain after it's discovered that his muscles, accustomed to Earth's greater gravity, now give him a decided advantage in strength. And when his captors take as prisoner Dejah Thoris, the lovely human-looking princess of the city of Helium, Carter must call upon every ounce of strength, courage, and ingenuity to rescue her-before Dejah becomes the slave of the depraved Thark leader, Tal Hajus!Excerpt:Her oval face was beautiful in the extreme, her every feature finely chisled and exquisite, her eyes large and lustrous and her head surmounted by a mass of coal black, waving hair, caught loosely into a strange yet becoming coiffure. Similar in face and figure to women of Earth, she was nevertheless a true Martian--and prisoner of the fierce green giants who held me captive, as well!",
        "year": "1912",
        "goodreads": "https://www.goodreads.com/book/show/40395.A_Princess_of_Mars",
        "bookshop": "https://www.google.com",
        "cover": "./covers/2.jpg"
    },
    {
        "id": "3",
        "slug": "the-man-in-the-high-castle",
        "title": "The Man in the High Castle",
        "author": "Philip K. Dick",
        "rating": "3.62",
        "genre": "Alternate History",
        "description": "It's America in 1962. Slavery is legal once again. The few Jews who still survive hide under assumed names. In San Francisco, the I Ching is as common as the Yellow Pages. All because some twenty years earlier the United States lost a war — and is now occupied by Nazi Germany and Japan.This harrowing, Hugo Award-winning novel is the work that established Philip K. Dick as an innovator in science fiction while breaking the barrier between science fiction and the serious novel of ideas. In it Dick offers a haunting vision of history as a nightmare from which it may just be possible to wake.",
        "year": "1962",
        "goodreads": "https://www.goodreads.com/book/show/216363.The_Man_in_the_High_Castle",
        "bookshop": "https://www.google.com",
        "cover": "./covers/3.jpg"
    },
    {
        "id": "4",
        "slug": "his-majestys-dragon",
        "title": "His Majesty's Dragon",
        "author": "Naomi Novik",
        "rating": "4.03",
        "genre": "Alternate History",
        "description": "Aerial combat brings a thrilling new dimension to the Napoleonic Wars as valiant warriors ride mighty fighting dragons, bred for size or speed. When HMS Reliant captures a French frigate and seizes the precious cargo, an unhatched dragon egg, fate sweeps Captain Will Laurence from his seafaring life into an uncertain future – and an unexpected kinship with a most extraordinary creature. Thrust into the rarified world of the Aerial Corps as master of the dragon Temeraire, he will face a crash course in the daring tactics of airborne battle. For as France’s own dragon-borne forces rally to breach British soil in Bonaparte’s boldest gambit, Laurence and Temeraire must soar into their own baptism of fire.",
        "year": "2006",
        "goodreads": "https://www.goodreads.com/book/show/28876.His_Majesty_s_Dragon",
        "bookshop": "https://www.google.com",
        "cover": "./covers/4.jpg"
    },
    {
        "id": "5",
        "slug": "the-road",
        "title": "The Road",
        "author": "Cormac McCarthy",
        "rating": "3.97",
        "genre": "Apocalyptic",
        "description": "A searing, postapocalyptic novel destined to become Cormac McCarthy’s masterpiece.A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don’t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other.The Road is the profoundly moving story of a journey. It boldly imagines a future in which no hope remains, but in which the father and his son, “each the other’s world entire,” are sustained by love. Awesome in the totality of its vision, it is an unflinching meditation on the worst and the best that we are capable of: ultimate destructiveness, desperate tenacity, and the tenderness that keeps two people alive in the face of total devastation.",
        "year": "2006",
        "goodreads": "https://www.goodreads.com/book/show/6288.The_Road",
        "bookshop": "https://www.google.com",
        "cover": "./covers/5.jpg"
    },
    {
        "id": "6",
        "slug": "the-stand",
        "title": "The Stand",
        "author": "Stephen King",
        "rating": "4.34",
        "genre": "Apocalyptic",
        "description": "This is the way the world ends: with a nanosecond of computer error in a Defense Department laboratory and a million casual contacts that form the links in a chain letter of death. And here is the bleak new world of the day after: a world stripped of its institutions and emptied of 99 percent of its people. A world in which a handful of panicky survivors choose sides -- or are chosen.",
        "year": "1978",
        "goodreads": "https://www.goodreads.com/book/show/149267.The_Stand",
        "bookshop": "https://www.google.com",
        "cover": "./covers/6.png"
    },
    {
        "id": "7",
        "slug": "neuromancer",
        "title": "Neuromancer",
        "author": "William Gibson",
        "rating": "3.9",
        "genre": "Cyberpunk",
        "description": "Hotwired to the leading edges of art and technology, Neuromancer is a cyberpunk, science fiction masterpiece—a classic that ranks with 1984 and Brave New World as one of the twentieth century’s most potent visions of the future.The Matrix is a world within the world, a global consensus-hallucination, the representation of every byte of data in cyberspace...Henry Dorsett Case was the sharpest data-thief in the business, until vengeful former employees crippled his nervous system. But now a new and very mysterious employer recruits him for a last-chance run. The target: an unthinkably powerful artificial intelligence orbiting Earth in service of the sinister Tessier-Ashpool business clan. With a dead man riding shotgun and Molly, mirror-eyed street-samurai, to watch his back, Case embarks on an adventure that ups the ante on an entire genre of fiction.The winner of the Hugo, Nebula, and Philip K. Dick Awards, Neuromancer was the first fully-realized glimpse of humankind’s digital future—a shocking vision that has challenged our assumptions about our technology and ourselves, reinvented the way we speak and think, and forever altered the landscape of our imaginations.",
        "year": "1984",
        "goodreads": "https://www.goodreads.com/book/show/6088007-neuromancer",
        "bookshop": "https://www.google.com",
        "cover": "./covers/7.jpg"
    },
    {
        "id": "8",
        "slug": "1984",
        "title": "1984",
        "author": "George Orwell",
        "rating": "4.19",
        "genre": "Dystopian",
        "description": "Among the seminal texts of the 20th century, Nineteen Eighty-Four is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949, the book offers political satirist George Orwell's nightmarish vision of a totalitarian, bureaucratic world and one poor stiff's attempt to find individuality. The brilliance of the novel is Orwell's prescience of modern life—the ubiquity of television, the distortion of the language—and his ability to construct such a thorough version of hell. Required reading for students since it was published, it ranks among the most terrifying novels ever written.",
        "year": "1949",
        "goodreads": "https://www.goodreads.com/book/show/40961427-1984",
        "bookshop": "https://www.google.com",
        "cover": "./covers/8.webp"
    },
    {
        "id": "9",
        "slug": "the-handmaids-tale",
        "title": "The Handmaid's Tale",
        "author": "Margaret Atwood",
        "rating": "4.12",
        "genre": "Dystopian",
        "description": "Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now . . . Funny, unexpected, horrifying, and altogether convincing, The Handmaid's Tale is at once scathing satire, dire warning, and tour de force.",
        "year": "1985",
        "goodreads": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale",
        "bookshop": "https://www.google.com",
        "cover": "./covers/9.jpg"
    },
    {
        "id": "10",
        "slug": "brave-new-world",
        "title": "Brave New World",
        "author": "Aldous Huxley",
        "rating": "3.99",
        "genre": "Dystopian",
        "description": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932. Largely set in a futuristic World State, inhabited by genetically modified citizens and an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation and classical conditioning that are combined to make a dystopian society which is challenged by only a single individual: the story's protagonist.",
        "year": "1932",
        "goodreads": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale",
        "bookshop": "https://www.google.com",
        "cover": "./covers/10.jpg"
    },
    {
        "id": "11",
        "slug": "red-mars",
        "title": "Red Mars",
        "author": "Kim Stanley Robinson",
        "rating": "3.86",
        "genre": "Hard Sci-Fi",
        "description": "In his most ambitious project to date, award-winning author Kim Stanley Robinson utilizes years of research & cutting-edge science in the 1st of a trilogy chronicling the colonization of Mars:For eons, sandstorms have swept the desolate landscape. For centuries, Mars has beckoned humans to conquer its hostile climate. Now, in 2026, a group of 100 colonists is about to fulfill that destiny.John Boone, Maya Toitavna, Frank Chalmers & Arkady Bogdanov lead a terraforming mission. For some, Mars will become a passion driving them to daring acts of courage & madness. For others it offers an opportunity to strip the planet of its riches. For the genetic alchemists, it presents a chance to create a biomedical miracle, a breakthrough that could change all we know about life & death. The colonists orbit giant satellite mirrors to reflect light to the surface. Black dust sprinkled on the polar caps will capture warmth. Massive tunnels, kilometers deep, will be drilled into the mantle to create stupendous vents of hot gases. Against this backdrop of epic upheaval, rivalries, loves & friendships will form & fall to pieces--for there are those who will fight to the death to prevent Mars from ever being changed.Brilliantly imagined, breathtaking in scope & ingenuity, Red Mars is an epic scientific saga, chronicling the next step in evolution, creating a world in its entirety. It shows a future, with both glory & tarnish, that awes with complexity & inspires with vision.",
        "year": "1992",
        "goodreads": "https://www.goodreads.com/book/show/77507.Red_Mars",
        "bookshop": "https://www.google.com",
        "cover": "./covers/11.jpg"
    },
    {
        "id": "12",
        "slug": "rendezvous-with-rama",
        "title": "Rendezvous with Rama",
        "author": "Arthur C. Clarke",
        "rating": "4.1",
        "genre": "Hard Sci-Fi",
        "description": "At first, only a few things are known about the celestial object that astronomers dub Rama. It is huge, weighing more than ten trillion tons. And it is hurtling through the solar system at an inconceivable speed. Then a space probe confirms the unthinkable: Rama is no natural object. It is, incredibly, an interstellar spacecraft. Space explorers and planet-bound scientists alike prepare for mankind's first encounter with alien intelligence. It will kindle their wildest dreams... and fan their darkest fears. For no one knows who the Ramans are or why they have come. And now the moment of rendezvous awaits — just behind a Raman airlock door.",
        "year": "1973",
        "goodreads": "https://www.goodreads.com/book/show/112537.Rendezvous_with_Rama",
        "bookshop": "https://www.google.com",
        "cover": "./covers/12.jpg"
    }
]