[
    {
        "id": "1",
        "slug": "the-war-of-the-worlds",
        "title": "The War of the Worlds",
        "author": "H.G. Wells",
        "rating": "3.83",
        "genre": "Aliens",
        "description": "When an army of invading Martians lands in England, panic and terror seize the population. As the aliens traverse the country in huge three-legged machines, incinerating all in their path with a heat ray and spreading noxious toxic gases, the people of the Earth must come to terms with the prospect of the end of human civilization and the beginning of Martian rule.Inspiring films, radio dramas, comic-book adaptations, television series and sequels,The War of the Worlds is a prototypical work of science fiction which has influenced every alien story that has come since, and is unsurpassed in its ability to thrill, well over a century since it was first published.",
        "year": "1898",
        "goodreads": "https://www.goodreads.com/book/show/8909.The_War_of_the_Worlds",
        "bookshop": "https://www.google.com",
        "cover": "./covers/1.avif"
    },
    {
        "id": "2",
        "slug": "a-princess-of-mars",
        "title": "A Princess of Mars",
        "author": "Edgar Rice Burroughs",
        "rating": "3.81",
        "genre": "Aliens",
        "description": "A Princess of Mars is the first of eleven thrilling novels that comprise Edgar Rice Burroughs' most exciting saga, known as The Martian Series. It's the beginning of an incredible odyssey in which John Carter, a gentleman from Virginia and a Civil War veteran, unexpectedly finds himself on to the red planet, scene of continuing combat among rival tribes. Captured by a band of six-limbed, green-skinned savage giants called Tharks, Carter soon is accorded all the honor of a chieftain after it's discovered that his muscles, accustomed to Earth's greater gravity, now give him a decided advantage in strength. And when his captors take as prisoner Dejah Thoris, the lovely human-looking princess of the city of Helium, Carter must call upon every ounce of strength, courage, and ingenuity to rescue her-before Dejah becomes the slave of the depraved Thark leader, Tal Hajus!Excerpt:Her oval face was beautiful in the extreme, her every feature finely chisled and exquisite, her eyes large and lustrous and her head surmounted by a mass of coal black, waving hair, caught loosely into a strange yet becoming coiffure. Similar in face and figure to women of Earth, she was nevertheless a true Martian--and prisoner of the fierce green giants who held me captive, as well!",
        "year": "1912",
        "goodreads": "https://www.goodreads.com/book/show/40395.A_Princess_of_Mars",
        "bookshop": "https://www.google.com",
        "cover": "./covers/2.jpg"
    },
    {
        "id": "3",
        "slug": "the-man-in-the-high-castle",
        "title": "The Man in the High Castle",
        "author": "Philip K. Dick",
        "rating": "3.62",
        "genre": "Alternate History",
        "description": "It's America in 1962. Slavery is legal once again. The few Jews who still survive hide under assumed names. In San Francisco, the I Ching is as common as the Yellow Pages. All because some twenty years earlier the United States lost a war — and is now occupied by Nazi Germany and Japan.This harrowing, Hugo Award-winning novel is the work that established Philip K. Dick as an innovator in science fiction while breaking the barrier between science fiction and the serious novel of ideas. In it Dick offers a haunting vision of history as a nightmare from which it may just be possible to wake.",
        "year": "1962",
        "goodreads": "https://www.goodreads.com/book/show/216363.The_Man_in_the_High_Castle",
        "bookshop": "https://www.google.com",
        "cover": "./covers/3.jpg"
    },
    {
        "id": "4",
        "slug": "his-majestys-dragon",
        "title": "His Majesty's Dragon",
        "author": "Naomi Novik",
        "rating": "4.03",
        "genre": "Alternate History",
        "description": "Aerial combat brings a thrilling new dimension to the Napoleonic Wars as valiant warriors ride mighty fighting dragons, bred for size or speed. When HMS Reliant captures a French frigate and seizes the precious cargo, an unhatched dragon egg, fate sweeps Captain Will Laurence from his seafaring life into an uncertain future – and an unexpected kinship with a most extraordinary creature. Thrust into the rarified world of the Aerial Corps as master of the dragon Temeraire, he will face a crash course in the daring tactics of airborne battle. For as France’s own dragon-borne forces rally to breach British soil in Bonaparte’s boldest gambit, Laurence and Temeraire must soar into their own baptism of fire.",
        "year": "2006",
        "goodreads": "https://www.goodreads.com/book/show/28876.His_Majesty_s_Dragon",
        "bookshop": "https://www.google.com",
        "cover": "./covers/4.jpg"
    },
    {
        "id": "5",
        "slug": "the-road",
        "title": "The Road",
        "author": "Cormac McCarthy",
        "rating": "3.97",
        "genre": "Apocalyptic",
        "description": "A searing, postapocalyptic novel destined to become Cormac McCarthy’s masterpiece.A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don’t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other.The Road is the profoundly moving story of a journey. It boldly imagines a future in which no hope remains, but in which the father and his son, “each the other’s world entire,” are sustained by love. Awesome in the totality of its vision, it is an unflinching meditation on the worst and the best that we are capable of: ultimate destructiveness, desperate tenacity, and the tenderness that keeps two people alive in the face of total devastation.",
        "year": "2006",
        "goodreads": "https://www.goodreads.com/book/show/6288.The_Road",
        "bookshop": "https://www.google.com",
        "cover": "./covers/5.jpg"
    },
    {
        "id": "6",
        "slug": "the-stand",
        "title": "The Stand",
        "author": "Stephen King",
        "rating": "4.34",
        "genre": "Apocalyptic",
        "description": "This is the way the world ends: with a nanosecond of computer error in a Defense Department laboratory and a million casual contacts that form the links in a chain letter of death. And here is the bleak new world of the day after: a world stripped of its institutions and emptied of 99 percent of its people. A world in which a handful of panicky survivors choose sides -- or are chosen.",
        "year": "1978",
        "goodreads": "https://www.goodreads.com/book/show/149267.The_Stand",
        "bookshop": "https://www.google.com",
        "cover": "./covers/6.png"
    },
    {
        "id": "7",
        "slug": "neuromancer",
        "title": "Neuromancer",
        "author": "William Gibson",
        "rating": "3.9",
        "genre": "Cyberpunk",
        "description": "Hotwired to the leading edges of art and technology, Neuromancer is a cyberpunk, science fiction masterpiece—a classic that ranks with 1984 and Brave New World as one of the twentieth century’s most potent visions of the future.The Matrix is a world within the world, a global consensus-hallucination, the representation of every byte of data in cyberspace...Henry Dorsett Case was the sharpest data-thief in the business, until vengeful former employees crippled his nervous system. But now a new and very mysterious employer recruits him for a last-chance run. The target: an unthinkably powerful artificial intelligence orbiting Earth in service of the sinister Tessier-Ashpool business clan. With a dead man riding shotgun and Molly, mirror-eyed street-samurai, to watch his back, Case embarks on an adventure that ups the ante on an entire genre of fiction.The winner of the Hugo, Nebula, and Philip K. Dick Awards, Neuromancer was the first fully-realized glimpse of humankind’s digital future—a shocking vision that has challenged our assumptions about our technology and ourselves, reinvented the way we speak and think, and forever altered the landscape of our imaginations.",
        "year": "1984",
        "goodreads": "https://www.goodreads.com/book/show/6088007-neuromancer",
        "bookshop": "https://www.google.com",
        "cover": "./covers/7.jpg"
    },
    {
        "id": "8",
        "slug": "1984",
        "title": "1984",
        "author": "George Orwell",
        "rating": "4.19",
        "genre": "Dystopian",
        "description": "Among the seminal texts of the 20th century, Nineteen Eighty-Four is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949, the book offers political satirist George Orwell's nightmarish vision of a totalitarian, bureaucratic world and one poor stiff's attempt to find individuality. The brilliance of the novel is Orwell's prescience of modern life—the ubiquity of television, the distortion of the language—and his ability to construct such a thorough version of hell. Required reading for students since it was published, it ranks among the most terrifying novels ever written.",
        "year": "1949",
        "goodreads": "https://www.goodreads.com/book/show/40961427-1984",
        "bookshop": "https://www.google.com",
        "cover": "./covers/8.webp"
    },
    {
        "id": "9",
        "slug": "the-handmaids-tale",
        "title": "The Handmaid's Tale",
        "author": "Margaret Atwood",
        "rating": "4.12",
        "genre": "Dystopian",
        "description": "Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now . . . Funny, unexpected, horrifying, and altogether convincing, The Handmaid's Tale is at once scathing satire, dire warning, and tour de force.",
        "year": "1985",
        "goodreads": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale",
        "bookshop": "https://www.google.com",
        "cover": "./covers/9.jpg"
    },
    {
        "id": "10",
        "slug": "brave-new-world",
        "title": "Brave New World",
        "author": "Aldous Huxley",
        "rating": "3.99",
        "genre": "Dystopian",
        "description": "Brave New World is a dystopian novel by English author Aldous Huxley, written in 1931 and published in 1932. Largely set in a futuristic World State, inhabited by genetically modified citizens and an intelligence-based social hierarchy, the novel anticipates huge scientific advancements in reproductive technology, sleep-learning, psychological manipulation and classical conditioning that are combined to make a dystopian society which is challenged by only a single individual: the story's protagonist.",
        "year": "1932",
        "goodreads": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale",
        "bookshop": "https://www.google.com",
        "cover": "./covers/10.jpg"
    },
    {
        "id": "11",
        "slug": "red-mars",
        "title": "Red Mars",
        "author": "Kim Stanley Robinson",
        "rating": "3.86",
        "genre": "Hard Sci-Fi",
        "description": "In his most ambitious project to date, award-winning author Kim Stanley Robinson utilizes years of research & cutting-edge science in the 1st of a trilogy chronicling the colonization of Mars:For eons, sandstorms have swept the desolate landscape. For centuries, Mars has beckoned humans to conquer its hostile climate. Now, in 2026, a group of 100 colonists is about to fulfill that destiny.John Boone, Maya Toitavna, Frank Chalmers & Arkady Bogdanov lead a terraforming mission. For some, Mars will become a passion driving them to daring acts of courage & madness. For others it offers an opportunity to strip the planet of its riches. For the genetic alchemists, it presents a chance to create a biomedical miracle, a breakthrough that could change all we know about life & death. The colonists orbit giant satellite mirrors to reflect light to the surface. Black dust sprinkled on the polar caps will capture warmth. Massive tunnels, kilometers deep, will be drilled into the mantle to create stupendous vents of hot gases. Against this backdrop of epic upheaval, rivalries, loves & friendships will form & fall to pieces--for there are those who will fight to the death to prevent Mars from ever being changed.Brilliantly imagined, breathtaking in scope & ingenuity, Red Mars is an epic scientific saga, chronicling the next step in evolution, creating a world in its entirety. It shows a future, with both glory & tarnish, that awes with complexity & inspires with vision.",
        "year": "1992",
        "goodreads": "https://www.goodreads.com/book/show/77507.Red_Mars",
        "bookshop": "https://www.google.com",
        "cover": "./covers/11.jpg"
    },
    {
        "id": "12",
        "slug": "rendezvous-with-rama",
        "title": "Rendezvous with Rama",
        "author": "Arthur C. Clarke",
        "rating": "4.1",
        "genre": "Hard Sci-Fi",
        "description": "At first, only a few things are known about the celestial object that astronomers dub Rama. It is huge, weighing more than ten trillion tons. And it is hurtling through the solar system at an inconceivable speed. Then a space probe confirms the unthinkable: Rama is no natural object. It is, incredibly, an interstellar spacecraft. Space explorers and planet-bound scientists alike prepare for mankind's first encounter with alien intelligence. It will kindle their wildest dreams... and fan their darkest fears. For no one knows who the Ramans are or why they have come. And now the moment of rendezvous awaits — just behind a Raman airlock door.",
        "year": "1973",
        "goodreads": "https://www.goodreads.com/book/show/112537.Rendezvous_with_Rama",
        "bookshop": "https://www.google.com",
        "cover": "./covers/12.jpg"
    },
    {
        "id": "13",
        "slug": "old-mans-war",
        "title": "Old Man's War",
        "author": "John Scalzi",
        "rating": "4.21",
        "genre": "Military",
        "description": "John Perry did two things on his 75th birthday. First he visited his wife's grave. Then he joined the army.The good news is that humanity finally made it into interstellar space. The bad news is that planets fit to live on are scarce-- and alien races willing to fight us for them are common. So: we fight. To defend Earth, and to stake our own claim to planetary real estate. Far from Earth, the war has been going on for decades: brutal, bloody, unyielding.Earth itself is a backwater. The bulk of humanity's resources are in the hands of the Colonial Defense Force. Everybody knows that when you reach retirement age, you can join the CDF. They don't want young people; they want people who carry the knowledge and skills of decades of living. You'll be taken off Earth and never allowed to return. You'll serve two years at the front. And if you survive, you'll be given a generous homestead stake of your own, on one of our hard-won colony planets.John Perry is taking that deal. He has only the vaguest idea what to expect. Because the actual fight, light-years from home, is far, far harder than he can imagine--and what he will become is far stranger.",
        "year": "2005",
        "goodreads": "https://www.goodreads.com/book/show/36510196-old-man-s-war",
        "bookshop": "https://www.google.com",
        "cover": "./covers/13.avif"
    },
    {
        "id": "14",
        "slug": "on-basilisk-station",
        "title": "On Basilisk Station",
        "author": "David Weber",
        "rating": "4.13",
        "genre": "Military",
        "description": "Honor Harrington in trouble: Having made him look the fool, she's been exiled to Basilisk Station in disgrace and set up for ruin by a superior who hates her. Her demoralized crew blames her for their ship's humiliating posting to an out-of-the-way picket station. The aborigines of the system's only habitable planet are smoking homicide-inducing hallucinogens. Parliament isn't sure it wants to keep the place; the major local industry is smuggling, the merchant cartels want her head; the star-conquering, so-called 'Republic' of Haven is Up to Something; and Honor Harrington has a single, over-age light cruiser with an armament that doesn't work to police the entire star system.But the people out to get her have made one mistake.They've made her mad!",
        "year": "1992",
        "goodreads": "https://www.goodreads.com/book/show/35921.On_Basilisk_Station",
        "bookshop": "https://www.google.com",
        "cover": "./covers/14.jpg"
    },
    {
        "id": "15",
        "slug": "i-robot",
        "title": "I, Robot",
        "author": "Isaac Asimov",
        "rating": "4.2",
        "genre": "Robots",
        "description": "Isaac Asimov's I, Robot launches readers on an adventure into a not-so-distant future where man and machine , struggle to redefinelife, love, and consciousness—and where the stakes are nothing less than survival. Filled with unforgettable characters, mind-bending speculation, and nonstop action, I, Robot is a powerful reading experience from one of the master storytellers of our time. I, ROBOT They mustn't harm a human being, they must obey hitman orders, and they must protect their own existence...but only so long as that doesn't violate rules one and two. With these Three Laws of Robotics, humanity embarked on perhaps its greatest adventure: the invention of the first positronic man. It was a bold new era of evolution that would open up enormous possibilities—and unforeseen risks. For the scientists who invented the earliest robots weren't content that their creations should ' remain programmed helpers, companions, and semisentient worker-machines. And soon the robots themselves; aware of their own intelligence, power, and humanity, aren't either. As humans and robots struggle to survive together—and sometimes against each other—on earth and in space, the future of both hangs in the balance. Human men and women confront robots gone mad, telepathic robots, robot politicians, and vast robotic intelligences that may already secretly control the world. And both are asking the same questions: What is human? And is humanity obsolete? In l, Robot Isaac Asimov changes forever our perception of robots, and human beings and updates the timeless myth of man's dream to play god. with all its rewards—and terrors.--front flap",
        "year": "1950",
        "goodreads": "https://www.goodreads.com/book/show/41804.I_Robot",
        "bookshop": "https://www.google.com",
        "cover": "./covers/15.jpg"
    },
    {
        "id": "16",
        "slug": "the-caves-of-steel",
        "title": "The Caves of Steel",
        "author": "Isaac Asimov",
        "rating": "4.17",
        "genre": "Robots",
        "description": "A millennium into the future two advancements have altered the course of human history: the colonization of the galaxy and the creation of the positronic brain. Isaac Asimov's Robot novels chronicle the unlikely partnership between a New York City detective and a humanoid robot who must learn to work together. Like most people left behind on an over-populated Earth, New York City police detective Elijah Baley had little love for either the arrogant Spacers or their robotic companions. But when a prominent Spacer is murdered under mysterious circumstances, Baley is ordered to the Outer Worlds to help track down the killer. The relationship between Life and his Spacer superiors, who distrusted all Earthmen, was strained from the start. Then he learned that they had assigned him a partner: R. Daneel Olivaw. Worst of all was that the 'R' stood for robot--and his positronic partner was made in the image and likeness of the murder victim!",
        "year": "1954",
        "goodreads": "https://www.goodreads.com/book/show/41811.The_Caves_of_Steel",
        "bookshop": "https://www.google.com",
        "cover": "./covers/16.jpg"
    },
    {
        "id": "17",
        "slug": "dune",
        "title": "Dune",
        "author": "Frank Herbert",
        "rating": "4.23",
        "genre": "Space Opera",
        "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...When House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream.",
        "year": "1965",
        "goodreads": "https://www.goodreads.com/book/show/44767458-dune",
        "bookshop": "https://www.google.com",
        "cover": "./covers/17.jpg"
    },
    {
        "id": "18",
        "slug": "consider-phlebas",
        "title": "Consider Phlebas",
        "author": "Iain M. Banks",
        "rating": "3.86",
        "genre": "Space Opera",
        "description": "The war raged across the galaxy. Billions had died, billions more were doomed. Moons, planets, the very stars themselves, faced destruction, cold-blooded, brutal, and worse, random. The Idirans fought for their Faith; the Culture for its moral right to exist. Principles were at stake. There could be no surrender.Within the cosmic conflict, an individual crusade. Deep within a fabled labyrinth on a barren world, a Planet of the Dead proscribed to mortals, lay a fugitive Mind. Both the Culture and the Idirans sought it. It was the fate of Horza, the Changer, and his motley crew of unpredictable mercenaries, human and machine, actually to find it, and with it their own destruction.",
        "year": "1987",
        "goodreads": "https://www.goodreads.com/book/show/8935689-consider-phlebas",
        "bookshop": "https://www.google.com",
        "cover": "./covers/18.jpg"
    },
    {
        "id": "19",
        "slug": "mortal-engines",
        "title": "Mortal Engines",
        "author": "Philip Reeve",
        "rating": "3.78",
        "genre": "Steampunk",
        "description": "'It was a dark, blustery afternoon in spring, and the city of London was chasing a small mining town across the dried-out bed of the old North Sea.' The great traction city London has been skulking in the hills to avoid the bigger, faster, hungrier cities loose in the Great Hunting Ground. But now, the sinister plans of Lord Mayor Mangus Crome can finally unfold.Thaddeus Valentine, London's Head Historian and adored famous archaeologist, and his lovely daughter, Katherine, are down in The Gut when the young assassin with the black scarf strikes toward his heart, saved by the quick intervention of Tom, a lowly third-class apprentice. Racing after the fleeing girl, Tom suddenly glimpses her hideous face: scarred from forehead to jaw, nose a smashed stump, a single eye glaring back at him. 'Look at what your Valentine did to me!' she screams. 'Ask him! Ask him what he did to Hester Shaw!' And with that she jumps down the waste chute to her death. Minutes later Tom finds himself tumbling down the same chute and stranded in the Out-Country, a sea of mud scored by the huge caterpillar tracks of cities like the one now steaming off over the horizon.In a stunning literary debut, Philip Reeve has created a painful dangerous unforgettable adventure story of surprises, set in a dark and utterly original world fueled by Municipal Darwinism -- and betrayal.",
        "year": "2001",
        "goodreads": "https://www.goodreads.com/book/show/287861.Mortal_Engines",
        "bookshop": "https://www.google.com",
        "cover": "./covers/19.jpg"
    },
    {
        "id": "20",
        "slug": "perdido-street-station",
        "title": "Perdido Street Station",
        "author": "China Miéville",
        "rating": "3.95",
        "genre": "Steampunk",
        "description": "Beneath the towering bleached ribs of a dead, ancient beast lies the city of New Crobuzon, where the unsavory deal is stranger to no one--not even to Isaac, a gifted and eccentric scientist who has spent a lifetime quietly carrying out his unique research. But when a half-bird, half-human creature known as the Garuda comes to him from afar, Isaac is faced with challenges he has never before encountered. Though the Garuda's request is scientifically daunting, Isaac is sparked by his own curiosity and an uncanny reverence for this curious stranger. Soon an eerie metamorphosis will occur that will permeate every fiber of New Crobuzon--and not even the Ambassador of Hell will challenge the malignant terror it evokes.",
        "year": "2000",
        "goodreads": "https://www.goodreads.com/book/show/68494.Perdido_Street_Station",
        "bookshop": "https://www.google.com",
        "cover": "./covers/20.jpg"
    },
    {
        "id": "21",
        "slug": "outlander",
        "title": "Outlander",
        "author": "Diana Gabaldon",
        "rating": "4.23",
        "genre": "Time Travel",
        "description": "The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743. Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives.",
        "year": "1991",
        "goodreads": "https://www.goodreads.com/book/show/10964.Outlander",
        "bookshop": "https://www.google.com",
        "cover": "./covers/21.jpg"
    },
    {
        "id": "22",
        "slug": "the-time-travelers-wife",
        "title": "The Time Traveler's Wife",
        "author": "Audrey Niffenegger",
        "rating": "3.98",
        "genre": "Time Travel",
        "description": "A funny, often poignant tale of boy meets girl with a twist: what if one of them couldn't stop slipping in and out of time? Highly original and imaginative, this debut novel raises questions about life, love, and the effects of time on relationships.Audrey Niffenegger’s innovative debut, The Time Traveler’s Wife, is the story of Clare, a beautiful art student, and Henry, an adventuresome librarian, who have known each other since Clare was six and Henry was thirty-six, and were married when Clare was twenty-three and Henry thirty-one. Impossible but true, because Henry is one of the first people diagnosed with Chrono-Displacement Disorder: periodically his genetic clock resets and he finds himself misplaced in time, pulled to moments of emotional gravity in his life, past and future. His disappearances are spontaneous, his experiences unpredictable, alternately harrowing and amusing. The Time Traveler’s Wife depicts the effects of time travel on Henry and Clare’s marriage and their passionate love for each other as the story unfolds from both points of view. Clare and Henry attempt to live normal lives, pursuing familiar goals—steady jobs, good friends, children of their own. All of this is threatened by something they can neither prevent nor control, making their story intensely moving and entirely unforgettable.",
        "year": "2003",
        "goodreads": "https://www.goodreads.com/book/show/18619684-the-time-traveler-s-wife",
        "bookshop": "https://www.google.com",
        "cover": "./covers/22.jpg"
    },
    {
        "id": "23",
        "slug": "enders-game",
        "title": "Ender's Game",
        "author": "Orson Scott Card",
        "rating": "4.3",
        "genre": "Aliens",
        "description": "Andrew 'Ender' Wiggin thinks he is playing computer simulated war games; he is, in fact, engaged in something far more desperate. The result of genetic experimentation, Ender may be the military genius Earth desperately needs in a war against an alien enemy seeking to destroy all human life. The only way to find out is to throw Ender into ever harsher training, to chip away and find the diamond inside, or destroy him utterly. Ender Wiggin is six years old when it begins. He will grow up fast.But Ender is not the only result of the experiment. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway almost as long. Ender's two older siblings, Peter and Valentine, are every bit as unusual as he is, but in very different ways. While Peter was too uncontrollably violent, Valentine very nearly lacks the capability for violence altogether. Neither was found suitable for the military's purpose. But they are driven by their jealousy of Ender, and by their inbred drive for power. Peter seeks to control the political process, to become a ruler. Valentine's abilities turn more toward the subtle control of the beliefs of commoner and elite alike, through powerfully convincing essays. Hiding their youth and identities behind the anonymity of the computer networks, these two begin working together to shape the destiny of Earth-an Earth that has no future at all if their brother Ender fails.Source: hatrack.com",
        "year": "1985",
        "goodreads": "https://www.goodreads.com/book/show/375802.Ender_s_Game",
        "bookshop": "https://www.google.com",
        "cover": "./covers/23.avif"
    },
    {
        "id": "24",
        "slug": "the-hitchhikers-guide-to-the-galaxy",
        "title": "The Hitchhiker's Guide to the Galaxy",
        "author": "Douglas Adams",
        "rating": "4.22",
        "genre": "Aliens",
        "description": "Seconds before the Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker's Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor.Together this dynamic pair begin a journey through space aided by quotes from The Hitchhiker's Guide ('A towel is about the most massively useful thing an interstellar hitchhiker can have') and a galaxy-full of fellow travelers: Zaphod Beeblebrox—the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian, Zaphod's girlfriend (formally Tricia McMillan), whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; Veet Voojagig, a former graduate student who is obsessed with the disappearance of all the ballpoint pens he bought over the years.",
        "year": "1979",
        "goodreads": "https://www.goodreads.com/book/show/386162.The_Hitchhiker_s_Guide_to_the_Galaxy",
        "bookshop": "https://www.google.com",
        "cover": "./covers/24.jpg"
    },
    {
        "id": "25",
        "slug": "awaken-me-darkly",
        "title": "Awaken Me Darkly",
        "author": "Gena Showalter",
        "rating": "3.89",
        "genre": "Aliens",
        "description": "RIDDING THE WORLD OF EVIL, ONE ALIEN AT A TIME: THAT'S MIA SNOW'S MISSION.  Snow is in the forecast.  In a time and place not too far away, Mia Snow is an alien huntress for the New Chicago Police Department. Heading up her expert team of Alien Investigation and Removal agents, Mia's unmatched at battling the elusive enemy among us, and she's the perfect girl for the job. She's seen her brother die at the hands of aliens. She's earned each of her scars. And she'll die before she cries. Now, a series of killings have Mia and her partner Dallas tracking alien suspects—but a sudden blast of violence leaves Dallas fighting for his life.  They are ice and fire.  The chance to save Dallas appears in the form of a tall, erotic stranger. An alien. A murder suspect. Kyrin en Arr, of the deadly Arcadian species, holds the power to heal the injured agent but not without a price. For Mia Snow, that price is surrendering to Kyrin's forbidden seduction...and embracing their electric attraction. She's walking a knife's edge, risking her badge and even her life. The closer she gets to Kyrin, the more Mia learns about her own heart, her human needs—and the shocking secret that will shatter everything she's ever believed.",
        "year": "2005",
        "goodreads": "https://www.goodreads.com/book/show/476492.Awaken_Me_Darkly",
        "bookshop": "https://www.google.com",
        "cover": "./covers/25.jpg"
    },
    {
        "id": "26",
        "slug": "jonathan-strange-mr-norrell",
        "title": "Jonathan Strange & Mr Norrell",
        "author": "Susanna Clarke",
        "rating": "3.82",
        "genre": "Alternate History",
        "description": "Sophisticated, witty, and ingeniously convincing, Susanna Clarke's magisterial novel weaves magic into a flawlessly detailed vision of historical England. She has created a world so thoroughly enchanting that eight hundred pages leave readers longing for more.English magicians were once the wonder of the known world, with fairy servants at their beck and call; they could command winds, mountains, and woods. But by the early 1800s they have long since lost the ability to perform magic. They can only write long, dull papers about it, while fairy servants are nothing but a fading memory.But at Hurtfew Abbey in Yorkshire, the rich, reclusive Mr Norrell has assembled a wonderful library of lost and forgotten books from England's magical past and regained some of the powers of England's magicians. He goes to London and raises a beautiful young woman from the dead. Soon he is lending his help to the government in the war against Napoleon Bonaparte, creating ghostly fleets of rain-ships to confuse and alarm the French.All goes well until a rival magician appears. Jonathan Strange is handsome, charming, and talkative-the very opposite of Mr Norrell. Strange thinks nothing of enduring the rigors of campaigning with Wellington's army and doing magic on battlefields. Astonished to find another practicing magician, Mr Norrell accepts Strange as a pupil. But it soon becomes clear that their ideas of what English magic ought to be are very different. For Mr Norrell, their power is something to be cautiously controlled, while Jonathan Strange will always be attracted to the wildest, most perilous forms of magic. He becomes fascinated by the ancient, shadowy figure of the Raven King, a child taken by fairies who became king of both England and Faerie, and the most legendary magician of all. Eventually Strange's heedless pursuit of long-forgotten magic threatens to destroy not only his partnership with Norrell, but everything that he holds dear.",
        "year": "2004",
        "goodreads": "https://www.goodreads.com/book/show/14201.Jonathan_Strange_Mr_Norrell",
        "bookshop": "https://www.google.com",
        "cover": "./covers/26.jpg"
    },
    {
        "id": "27",
        "slug": "fatherland",
        "title": "Fatherland",
        "author": "Robert Harris",
        "rating": "3.99",
        "genre": "Alternate History",
        "description": "It is twenty years after Nazi Germany's triumphant victory in World War II and the entire country is preparing for the grand celebration of the Führer's seventy-fifth birthday, as well as the imminent peacemaking visit from President Kennedy.Meanwhile, Berlin Detective Xavier March — a disillusioned but talented investigation of a corpse washed up on the shore of a lake. When a dead man turns out to be a high-ranking Nazi commander, the Gestapo orders March off the case immediately. Suddenly other unrelated deaths are anything but routine.Now obsessed by the case, March teams up with a beautiful, young American journalist and starts asking questions... dangerous questions. What they uncover is a terrifying and long-concealed conspiracy of such astounding and mind-numbing terror that is it certain to spell the end of the Third Reich — if they can live long enough to tell the world about it.",
        "year": "1991",
        "goodreads": "https://www.goodreads.com/book/show/56842.Fatherland",
        "bookshop": "https://www.google.com",
        "cover": "./covers/27.jpg"
    },
    {
        "id": "28",
        "slug": "throne-of-jade",
        "title": "Throne of Jade",
        "author": "Naomi Novik",
        "rating": "3.87",
        "genre": "Alternate History",
        "description": "When Britain intercepted a French ship and its precious cargo–an unhatched dragon’s egg–Capt. Will Laurence of HMS Reliant unexpectedly became master and commander of the noble dragon he named Temeraire. As new recruits in Britain’s Aerial Corps, man and dragon soon proved their mettle in daring combat against Bonaparte’s invading forces. Now China has discovered that its rare gift, intended for Napoleon, has fallen into British hands–and an angry Chinese delegation vows to reclaim the remarkable beast. But Laurence refuses to cooperate. Facing the gallows for his defiance, Laurence has no choice but to accompany Temeraire back to the Far East–a long voyage fraught with peril, intrigue, and the untold terrors of the deep. Yet once the pair reaches the court of the Chinese emperor, even more shocking discoveries and darker dangers await.",
        "year": "2006",
        "goodreads": "https://www.goodreads.com/book/show/14069.Throne_of_Jade",
        "bookshop": "https://www.google.com",
        "cover": "./covers/28.jpg"
    },
    {
        "id": "29",
        "slug": "the-years-of-rice-and-salt",
        "title": "The Years of Rice and Salt",
        "author": "Kim Stanley Robinson",
        "rating": "3.74",
        "genre": "Alternate History",
        "description": "It is the fourteenth century and one of the most apocalyptic events in human history is set to occur - the coming of the Black Death. History teaches us that a third of Europe's population was destroyed. But what if? What if the plague killed 99 percent of the population instead? How would the world have changed? This is a look at the history that could have been: a history that stretches across centuries, a history that sees dynasties and nations rise and crumble, a history that spans horrible famine and magnificent innovation. These are the years of rice and salt.",
        "year": "2002",
        "goodreads": "https://www.goodreads.com/book/show/2723.The_Years_of_Rice_and_Salt",
        "bookshop": "https://www.google.com",
        "cover": "./covers/29.jpg"
    },
    {
        "id": "30",
        "slug": "1632",
        "title": "1632",
        "author": "Eric Flint",
        "rating": "4.04",
        "genre": "Alternate History",
        "description": "FREEDOM AND JUSTICE -- AMERICAN STYLE 1632 And in northern Germany things couldn't get much worse. Famine. Disease. Religous war laying waste the cities. Only the aristocrats remained relatively unscathed; for the peasants, death was a mercy. 2000 Things are going OK in Grantville, West Virginia, and everybody attending the wedding of Mike Stearn's sister (including the entire local chapter of the United Mine Workers of America, which Mike leads) is having a good time. THEN, EVERYTHING CHANGED.... When the dust settles, Mike leads a group of armed miners to find out what happened and finds the road into town is cut, as with a sword. On the other side, a scene out of Hell: a man nailed to a farmhouse door, his wife and daughter attacked by men in steel vests. Faced with this, Mike and his friends don't have to ask who to shoot. At that moment Freedom and Justice, American style, are introduced to the middle of the Thirty Years' War.",
        "year": "2000",
        "goodreads": "https://www.goodreads.com/book/show/16967.1632",
        "bookshop": "https://www.google.com",
        "cover": "./covers/30.jpg"
    },
    {
        "id": "31",
        "slug": "snow-crash",
        "title": "Snow Crash",
        "author": "Neal Stephenson",
        "rating": "4.02",
        "genre": "Cyberpunk",
        "description": "In reality, Hiro Protagonist delivers pizza for Uncle Enzo's CosoNostra Pizza Inc., but in the Metaverse he's a warrior prince. Plunging headlong into the enigma of a new computer virus that's striking down hackers everywhere, he races along the neon-lit streets on a search-and-destroy mission for the shadowy virtual villain threatening to bring about infocalypse. Snow Crash is a mind-altering romp through a future America so bizarre, so outrageous… you'll recognize it immediately.",
        "year": "1978",
        "goodreads": "https://www.goodreads.com/book/show/40651883-snow-crash",
        "bookshop": "https://www.google.com",
        "cover": "./covers/31.jpg"
    },
    {
        "id": "32",
        "slug": "oryx-and-crake",
        "title": "Oryx and Crake",
        "author": "Margaret Atwood",
        "rating": "4.01",
        "genre": "Apocalyptic",
        "description": "Oryx and Crake is at once an unforgettable love story and a compelling vision of the future. Snowman, known as Jimmy before mankind was overwhelmed by a plague, is struggling to survive in a world where he may be the last human, and mourning the loss of his best friend, Crake, and the beautiful and elusive Oryx whom they both loved. In search of answers, Snowman embarks on a journey–with the help of the green-eyed Children of Crake–through the lush wilderness that was so recently a great city, until powerful corporations took mankind on an uncontrolled genetic engineering ride. Margaret Atwood projects us into a near future that is both all too familiar and beyond our imagining.",
        "year": "2003",
        "goodreads": "https://www.goodreads.com/book/show/46756.Oryx_and_Crake",
        "bookshop": "https://www.google.com",
        "cover": "./covers/32.jpg"
    },
    {
        "id": "33",
        "slug": "count-zero",
        "title": "Count Zero",
        "author": "William Gibson",
        "rating": "4.01",
        "genre": "Cyberpunk",
        "description": "A corporate mercenary wakes in a reconstructed body, a beautiful woman by his side. Then Hosaka Corporation reactivates him, for a mission more dangerous than the one he’s recovering from: to get a defecting chief of R&D—and the biochip he’s perfected—out intact. But this proves to be of supreme interest to certain other parties—some of whom aren’t remotely human...",
        "year": "1986",
        "goodreads": "https://www.goodreads.com/book/show/22200.Count_Zero",
        "bookshop": "https://www.google.com",
        "cover": "./covers/33.jpg"
    },
    {
        "id": "34",
        "slug": "altered-carbon",
        "title": "Altered Carbon",
        "author": "Richard K. Morgan",
        "rating": "4.05",
        "genre": "Cyberpunk",
        "description": "Four hundred years from now mankind is strung out across a region of interstellar space inherited from an ancient civilization discovered on Mars. The colonies are linked together by the occasional sublight colony ship voyages and hyperspatial data-casting. Human consciousness is digitally freighted between the stars and downloaded into bodies as a matter of course.But some things never change. So when ex-envoy, now-convict Takeshi Kovacs has his consciousness and skills downloaded into the body of a nicotine-addicted ex-thug and presented with a catch-22 offer, he really shouldn't be surprised. Contracted by a billionaire to discover who murdered his last body, Kovacs is drawn into a terrifying conspiracy that stretches across known space and to the very top of society.",
        "year": "2002",
        "goodreads": "https://www.goodreads.com/book/show/40792913-altered-carbon",
        "bookshop": "https://www.google.com",
        "cover": "./covers/34.jpg"
    },
    {
        "id": "35",
        "slug": "mona-lisa-overdrive",
        "title": "Mona Lisa Overdrive",
        "author": "William Gibson",
        "rating": "3.99",
        "genre": "Cyberpunk",
        "description": "William Gibson, author of the extraordinary multiaward-winning novel Neuromancer, has written his most brilliant and thrilling work to date... The Mona Lisa Overdrive. Enter Gibson's unique world - lyric and mechanical, erotic and violent, sobering and exciting - where multinational corporations and high tech outlaws vie for power, traveling into the computer-generated universe known as cyberspace. Into this world comes Mona, a young girl with a murky past and an uncertain future whose life is on a collision course with internationally famous Sense/Net star Angie Mitchell. Since childhood, Angie has been able to tap into cyberspace without a computer. Now, from inside cyberspace, a kidnapping plot is masterminded by a phantom entity who has plans for Mona, Angie, and all humanity, plans that cannot be controlled... or even known. And behind the intrigue lurks the shadowy Yakuza, the powerful Japanese underworld, whose leaders ruthlessly manipulate people and events to suit their own purposes... or so they think.",
        "year": "1988",
        "goodreads": "https://www.goodreads.com/book/show/154091.Mona_Lisa_Overdrive",
        "bookshop": "https://www.google.com",
        "cover": "./covers/35.jpg"
    },
    {
        "id": "36",
        "slug": "do-androids-dream-of-electric-sheep",
        "title": "Do Androids Dream of Electric Sheep",
        "author": "Philip K. Dick",
        "rating": "4.08",
        "genre": "Cyberpunk",
        "description": "It was January 2021, and Rick Deckard had a license to kill.Somewhere among the hordes of humans out there, lurked several rogue androids. Deckard's assignment--find them and then...'retire' them. Trouble was, the androids all looked exactly like humans, and they didn't want to be found!",
        "year": "1968",
        "goodreads": "https://www.goodreads.com/book/show/36402034-do-androids-dream-of-electric-sheep",
        "bookshop": "https://www.google.com",
        "cover": "./covers/36.jpg"
    },
    {
        "id": "37",
        "slug": "fahrenheit-451",
        "title": "Fahrenheit 451",
        "author": "Ray Bradbury",
        "rating": "3.99",
        "genre": "Dystopian",
        "description": "Guy Montag is a fireman. In his world, where television rules and literature is on the brink of extinction, firemen start fires rather than put them out. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden.Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television 'family'. But then he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people did not live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television.When Mildred attempts suicide and Clarisse suddenly disappears, Montag begins to question everything he has ever known.",
        "year": "1953",
        "goodreads": "https://www.goodreads.com/book/show/13079982-fahrenheit-451",
        "bookshop": "https://www.google.com",
        "cover": "./covers/37.webp"
    },
    {
        "id": "38",
        "slug": "the-giver",
        "title": "The Giver",
        "author": "Lois Lowry",
        "rating": "4.13",
        "genre": "Dystopian",
        "description": "The Giver, the 1994 Newbery Medal winner, has become one of the most influential novels of our time. The haunting story centers on twelve-year-old Jonas, who lives in a seemingly ideal, if colorless, world of conformity and contentment. Not until he is given his life assignment as the Receiver of Memory does he begin to understand the dark, complex secrets behind his fragile community.",
        "year": "1993",
        "goodreads": "https://www.goodreads.com/book/show/3636.The_Giver",
        "bookshop": "https://www.google.com",
        "cover": "./covers/38.jpg"
    },
    {
        "id": "39",
        "slug": "animal-farm",
        "title": "Animal Farm",
        "author": "George Orwell",
        "rating": "4.13",
        "genre": "Dystopian",
        "description": "A farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned –a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible. When Animal Farm was first published, Stalinist Russia was seen as its target. Today it is devastatingly clear that wherever and whenever freedom is attacked, under whatever banner, the cutting clarity and savage comedy of George Orwell’s masterpiece have a meaning and message still ferociously fresh.",
        "year": "1945",
        "goodreads": "https://www.goodreads.com/book/show/170448.Animal_Farm",
        "bookshop": "https://www.google.com",
        "cover": "./covers/39.jpg"
    },
    {
        "id": "40",
        "slug": "uglies",
        "title": "Uglies",
        "author": "Scott Westerfeld",
        "rating": "3.85",
        "genre": "Dystopian",
        "description": "Tally is about to turn sixteen, and she can't wait. In just a few weeks she'll have the operation that will turn her from a repellent ugly into a stunning pretty. And as a pretty, she'll be catapulted into a high-tech paradise where her only job is to have fun.But Tally's new friend Shay isn't sure she wants to become a pretty. When Shay runs away, Tally learns about a whole new side of the pretty world—and it isn't very pretty. The authorities offer Tally a choice: find her friend and turn her in, or never turn pretty at all. Tally's choice will change her world forever....",
        "year": "2005",
        "goodreads": "https://www.goodreads.com/book/show/24770.Uglies",
        "bookshop": "https://www.google.com",
        "cover": "./covers/40.jpg"
    }
]